RocketDevil/PURE-WARDRIVER/esp32_marauder/WiFiScan.h
#define CLEAR_APS   0
#define CLEAR_IPS   1
#define CLEAR_AT    2
#define CLEAR_FLIP  3
#define CLEAR_STA   4
#define CLEAR_PINE  5
#define CLEAR_MULTI 6
#define CLEAR_SSID  7
#define CLEAR_BLE   8

#define WIGLE_UPLOAD 0
#define WDG_UPLOAD   1
#define BOTH_UPLOAD  2

// PURE WARDRIVER: SD upload credentials.
#define UPLOAD_WIFI_FILE "/wifi-upload-credentials.txt"
#define UPLOAD_API_FILE "/API.txt"
#define UPLOAD_WIFI_IDLE_MS (5UL * 60UL * 1000UL)

// Pure Wardrive: EvilPortal removed.

#ifdef HAS_SCREEN
  extern Display display_obj;
#endif
#ifdef HAS_SD
  extern SDInterface sd_obj;
#endif
#ifdef HAS_GPS
  extern GpsInterface gps_obj;
#endif
extern Buffer buffer_obj;
#ifdef HAS_BATTERY
  extern BatteryInterface battery_obj;
#endif
extern Settings settings_obj;
#ifdef HAS_FLIPPER_LED
  extern flipperLED flipper_led;
#elif defined(XIAO_ESP32_S3)
  extern xiaoLED xiao_led;
#elif defined(MARAUDER_M5STICKC)
  extern stickcLED stickc_led;
#elif defined(HAS_NEOPIXEL_LED) || defined(HAS_T_DONGLE_LED)
  extern LedInterface led_obj;
#endif

esp_err_t esp_wifi_80211_tx(wifi_interface_t ifx, const void *buffer, int len, bool en_sys_seq);

#define EMPTY_ENTRY 0
#define VALID_ENTRY 1
#define TOMBSTONE_ENTRY 2

#ifdef HAS_BT

#define IS_AIRTAG 0
#define IS_FMNA   1
#define IS_DULT   2
static constexpr uint8_t AIRTAG_BEEP_COMMAND = 0xAF;

static const NimBLEUUID AIRTAG_SERVICE_UUID(
    "7dfc9000-7d1c-4951-86aa-8d9728f8d66c"
);

static const NimBLEUUID AIRTAG_CHARACTERISTIC_UUID(
    "7dfc9001-7d1c-4951-86aa-8d9728f8d66c"
);

static const NimBLEUUID FMNA_SERVICE_UUID(
    "0000fd44-0000-1000-8000-00805f9b34fb"
);

static const NimBLEUUID FMNA_SOUND_CHARACTERISTIC_UUID(
    "4f860003-943b-49ef-bed4-2f730304427a"
);

static const NimBLEUUID DULT_SERVICE_UUID(
    "15190001-12f4-c226-88ed-2ac5579f2a85"
);

static const NimBLEUUID DULT_SOUND_CHARACTERISTIC_UUID(
    "8e0c0001-1d68-fb92-bf61-48377421680e"
);

static const uint8_t FMNA_START_SOUND_COMMAND[] = {
    0x01, 0x00, 0x03
};

static const uint8_t FMNA_STOP_SOUND_COMMAND[] = {
    0x01, 0x01, 0x03
};

static const uint8_t DULT_START_SOUND_COMMAND[] = {
    0x00, 0x03
};

static const uint8_t DULT_STOP_SOUND_COMMAND[] = {
    0x01, 0x03
};

static NimBLEAddress pendingAddress(
    "00:00:00:00:00:00",
    BLE_ADDR_PUBLIC
);

bool connectionPending = false;
bool operationInProgress = false;
#endif

#pragma pack(push, 1)
struct MacEntry {
  uint8_t  mac[6];
  uint32_t last_seen_ms;
  uint16_t frame_count;
  int32_t  first_lat_e6;
  int32_t  first_lon_e6;
  int32_t  last_lat_e6;
  int32_t  last_lon_e6;
  bool following;
  int32_t dloc;
  int8_t rssi;
  bool bt;
};
#pragma pack(pop)

struct AirTag {
    String mac;                  // MAC address of the AirTag
    std::vector<uint8_t> payload; // Payload data
    uint16_t payloadSize;
    bool selected;
    int8_t rssi;
    uint32_t last_seen;
    bool is_airtag   = false;
    bool is_fmna     = false;
    bool is_dult     = false;
    bool connectable = true;
    #ifdef HAS_BT
    NimBLEAddress device_address;
    #endif
};

struct Flipper {
  String mac;
  String name;
  int8_t rssi = -128;
  uint32_t last_seen = 0;
};

struct BleDevice {
  uint8_t  mac[6];
  String   name;
  String   device_type;
  bool     selected = false;
  int      rssi     = -128;
  uint32_t last_seen_ms = 0;
};

#ifdef HAS_PSRAM
  extern struct mac_addr* mac_history;
#endif

enum class MacSortMode : uint8_t {
  MOST_RECENT,
  MOST_FRAMES,
  HIGH_RSSI
};

class WiFiScan
{
  private:
    // Wardriver thanks to https://github.com/JosephHewitt
    int arp_count = 0;
    #ifndef HAS_PSRAM
      struct mac_addr mac_history[mac_history_len];
    #endif

    int current_act_len = 0;

    uint32_t chanActTime = 0;

    uint8_t ap_mac[6] = {0xDE, 0xAD, 0xBE, 0xEF, 0xFE, 0xED};
    uint8_t sta_mac[6] = {0xDE, 0xAD, 0xBE, 0xEF, 0xFE, 0xED};

    // Settings
    uint mac_history_cursor = 0;
    uint8_t channel_hop_delay = 1;

    #ifdef HAS_DIRECT_UPLOAD
      WiFiClientSecure *client = new WiFiClientSecure();
    #endif
  
    #if defined(HAS_SCREEN) && (defined(HAS_ILI9341) || \
        (defined(MARAUDER_MINI_V3) && !defined(DUAL_MINI_C5)) || \
        defined(MARAUDER_CARDPUTER) || defined(MARAUDER_CARDPUTER_ADV))
      static const uint8_t PACKET_MONITOR_COLUMN_WIDTH = 4;
      #if defined(MARAUDER_MINI_V3) || defined(MARAUDER_CARDPUTER) || defined(MARAUDER_CARDPUTER_ADV)
        static const uint8_t PACKET_MONITOR_GRAPH_LEFT = 24;
      #else
        static const uint8_t PACKET_MONITOR_GRAPH_LEFT = 32;
      #endif
      static const uint16_t PACKET_MONITOR_REFRESH_MS = 200;
      #if defined(MARAUDER_CARDPUTER) || defined(MARAUDER_CARDPUTER_ADV)
        // Match the proven Mini v3 graph's 26-sample time window. The wider
        // Cardputer panel changes only the horizontal spacing, not the data
        // window, sampling cadence, scaling, or bar renderer.
        static const uint16_t PACKET_MONITOR_HISTORY_LEN = (128 - 24) / 4;
        static const uint8_t PACKET_MONITOR_COLUMN_STEP =
            (SCREEN_WIDTH - PACKET_MONITOR_GRAPH_LEFT) / PACKET_MONITOR_HISTORY_LEN;
      #else
        static const uint16_t PACKET_MONITOR_HISTORY_LEN =
            (SCREEN_WIDTH - PACKET_MONITOR_GRAPH_LEFT) / PACKET_MONITOR_COLUMN_WIDTH;
        static const uint8_t PACKET_MONITOR_COLUMN_STEP = PACKET_MONITOR_COLUMN_WIDTH;
      #endif
      uint16_t packet_monitor_beacons[PACKET_MONITOR_HISTORY_LEN] = {};
      uint16_t packet_monitor_deauths[PACKET_MONITOR_HISTORY_LEN] = {};
      uint16_t packet_monitor_probes[PACKET_MONITOR_HISTORY_LEN] = {};
      // Pure Wardrive: packet-monitor methods removed.
    #endif

    bool wsl_bypass_enabled = false;

    bool scan_complete = false;

    uint8_t wardrive_channel_index = 0;
    GeofenceConfig geofences[MAX_GEOFENCES];
    bool geofence_paused = false;
    uint32_t last_geofence_check = 0;
    String active_geofence_name = "";
    bool updateGeofenceState(bool force = false);
    void renderWardriveGeofenceState();
    void drawWardriveGeofenceBadge();

    //int num_beacon = 0; // GREEN
    //int num_probe = 0; // BLUE
    //int num_deauth = 0; // RED

    uint32_t initTime = 0;
    uint32_t last_ui_update = 0;
    uint32_t last_sour_apple_update = 0;
    bool run_setup = true;
    void initWiFi(uint8_t scan_mode);
    uint8_t bluetoothScanTime = 5;
    int packets_sent = 0;
    const wifi_promiscuous_filter_t filt = {.filter_mask=WIFI_PROMIS_FILTER_MASK_MGMT | WIFI_PROMIS_FILTER_MASK_DATA};
    #ifdef HAS_BT
      NimBLEScan* pBLEScan;
    #endif
    #ifdef HAS_NIMBLE_2
      NimBLEClient* nimbleClient;
    #endif

