RocketDevil/PURE-WARDRIVER/esp32_marauder/WiFiScan.h
    uint8_t association_packet[200] = {
                              0x00, 0x10, // Frame Control (Association Request) PM=1
                              0x3a, 0x01, // Duration
                              0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, // Destination (Broadcast)
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // Source (Fake Source or BSSID)
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // BSSID
                              0x00, 0x00,                         // Sequence Control
                              0x31, 0x00,                         // Capability Information (PM=1)
                              0x0a, 0x00,                         // Listen Interval
                              0x00,                               // SSID tag
                              0x00,                               // SSID length      
                          };

    // Pure Wardrive: BLE-spam payload types removed.

      #ifdef HAS_BT

      struct BLEData
      {
        NimBLEAdvertisementData AdvData;
        NimBLEAdvertisementData ScanData;
      };

      struct WatchModel
      {
          uint8_t value;
          const char *name;
      };

      WatchModel* watch_models = nullptr;

      static void scanCompleteCB(BLEScanResults scanResults);
      // Pure Wardrive: GetUniversalAdvertisementData removed.
    #endif

    // Pure Wardrive: FindMy decls removed.

    bool wigleUpload(String filePath);
    bool wdgwarsUpload(String filePath);
    void writeSidecar(String filePath, String service);
    bool sidecarExists(String filePath, String service); 
    #ifdef HAS_SCREEN
      void drawUploadProgress(const char* service, uint8_t percent, bool waiting = false);
    #endif

    // Pure Wardrive: foxhunt/attack UI decls removed.
    void throwThatShitInACircle();
    // Pure Wardrive: scanner stage decls removed.
    void setLEDMode(int mode);
    void setWiFiMode(wifi_mode_t mode, wifi_promiscuous_cb_t cb);
    void setupScanDisplayArea(uint16_t background, uint16_t color);
    // Pure Wardrive: scanner UI decls removed.
    void showNetworkInfo(bool show_display = true);
    void resetNetworkScanDisplay(const String& target_line, const String& status_line);
    void addNetworkScanDisplayResult(const String& result_line);
    void finishNetworkScanDisplay(const String& result_label);
    void setNetworkInfo();
    // Pure Wardrive: port/ping scan decls removed.
    String extractManufacturer(const uint8_t* payload);
    int checkMatchAP(char addr[], bool update_ap = true);
    uint8_t getSecurityType(const uint8_t* beacon, uint16_t len);
    bool mac_cmp(struct mac_addr addr1, struct mac_addr addr2);
    // Pure Wardrive: u8 mac_cmp removed (SAE-only).
    // Pure Wardrive: wardrive POI file removed (no wardrive_poi_*.gpx).

    void executeWarDrive();
    // Pure Wardrive: attack/BLE-spam decls removed.
    void startWardriverWiFi();
    void broadcastCustomBeacon(uint32_t current_time, ssid custom_ssid, bool for_camera = false);
    void broadcastCustomBeacon(uint32_t current_time, AccessPoint custom_ssid, int scan_mode);
    void broadcastSetSSID(uint32_t current_time, const char* ESSID, uint8_t chan = 0, bool legit = false);
    // Pure Wardrive: pentest scan decls removed (incl. executeFindMyLive).
    void RunGPSNmea();
    void RunBeaconScan(uint8_t scan_mode, uint16_t color);
    void RunBluetoothScan(uint8_t scan_mode, uint16_t color);
    // Pure Wardrive: pentest scan decls removed (RunSourApple, RunFindMyLive,
    // RunSwiftpairSpam, RunEvilPortal, RunPingScan, RunPortScanAll).
    bool checkMem();
    void writeHeader(bool poi = false);
    void writeFooter(bool poi = false);
    void displayWardriveStats();
    // Pure Wardrive: displayAPStats removed.


  public:
    struct FoxHuntTarget {
      uint8_t mac[6] = {};
      String name = "";
      int8_t rssi = -128;
      uint8_t channel = 1;
      bool bluetooth = false;
      bool active = false;
      uint32_t last_seen_ms = 0;
      String advertised_address = "";
    };

    FoxHuntTarget fox_hunt_target;

    marauder::GpsTrackerStats gps_tracker_stats;
    uint32_t wardrive_start_ms = 0;  // PURE WARDRIVER: scan elapsed clock

    volatile bool bt_cb_busy = false;
    volatile bool bt_pending_clear = false;

    bool send_deauth = false;

    size_t retainedAccessPointCount() const;
    size_t retainedStationCount() const;
    size_t retainedBleDeviceCount() const;

    bool channel_hop = false;
    uint8_t connected_devices = 0;


    static MacEntry mac_entries[mac_history_len_half];
    static uint8_t mac_entry_state[mac_history_len_half];

    #ifdef MARAUDER_CYD_C5
      #define PURE_WARDRIVER_BOARD "NM-CYD-C5"
    #elif defined(MARAUDER_CARDPUTER_ADV)
      #define PURE_WARDRIVER_BOARD "M5 Cardputer ADV"
    #else
      #define PURE_WARDRIVER_BOARD "Marauder v8"
    #endif
    String header_line = "WigleWifi-1.6,appRelease=" + (String)PURE_WARDRIVER_VERSION + ",model=PURE WARDRIVER,release=" + (String)PURE_WARDRIVER_VERSION + ",device=PURE WARDRIVER,display=SPI TFT,board=" PURE_WARDRIVER_BOARD ",brand=PURE WARDRIVER,star=Sol,body=3,subBody=0\nMAC,SSID,AuthMode,FirstSeen,Channel,Frequency,RSSI,CurrentLatitude,CurrentLongitude,AltitudeMeters,AccuracyMeters,RCOIs,MfgrId,Type\n";

    static uint16_t channelToFrequency(uint8_t channel) {
      if (channel >= 1 && channel <= 14)
        return 2407 + channel * 5;
      else if (channel >= 32 && channel <= 233)
        return 5000 + channel * 5;
      return 0;
    }

    uint8_t dual_band_channels[DUAL_BAND_CHANNELS] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 32, 36, 40, 44, 48, 52, 56, 60, 64, 68, 72, 76, 80, 84, 88, 92, 96, 100, 104, 108, 112, 116, 120, 124, 128, 132, 136, 140, 144, 149, 153, 157, 161, 165, 169, 173, 177};

    uint8_t oui_list[27][3] = {
    {0x58, 0x8E, 0x81},
    {0xCC, 0xCC, 0xCC},
    {0xEC, 0x1B, 0xBD},
    {0x90, 0x35, 0xEA},
    {0x04, 0x0D, 0x84},
    {0xF0, 0x82, 0xC0},
    {0x1C, 0x34, 0xF1},
    {0x38, 0x5B, 0x44},
    {0x94, 0x34, 0x69},
    {0xB4, 0xE3, 0xF9},
    {0x70, 0xC9, 0x4E},
    {0x3C, 0x91, 0x80},
    {0xD8, 0xF3, 0xBC},
    {0x80, 0x30, 0x49},
    {0x14, 0x5A, 0xFC},
    {0x74, 0x4C, 0xA1},
    {0x08, 0x3A, 0x88},
    {0x9C, 0x2F, 0x9D},
    {0x94, 0x08, 0x53},
    {0xE4, 0xAA, 0xEA},
    {0xF4, 0x6A, 0xDD},
    {0xF8, 0xA2, 0xD6},
    {0xE0, 0x0A, 0xF6},
    {0x00, 0xF4, 0x8D},
    {0xD0, 0x39, 0x57},
    {0xE8, 0xD0, 0xFC},
    {0xB4, 0x1E, 0x52}
    };

