RocketDevil/PURE-WARDRIVER/esp32_marauder/WiFiScan.h
    uint8_t dual_band_channel_index = 0;

    // Shoutout https://github.com/NullPxl
    const uint16_t META_IDENTIFIERS[6] = {
      0xFD5F,  // Meta (0xFD5F)
      0xFEB7,  // Meta (0xFEB7)
      0xFEB8,  // Meta (0xFEB8)
      0x01AB,  // Meta (0x01AB)
      0x058E,  // Meta (0x058E)
      0x0D53,   // Luxottica (0x0D53)
    };

    const uint16_t BLOCKED_IDENTIFIERS[5] = {
      0xFD5A,  // Samsung
      0xFD69,   // Samsung
      0x004C, //apple
      0x0006, // microsoft
      0xFEF3, // phone
    };

    // Stuff for RAW stats
    uint32_t mgmt_frames = 0;
    uint32_t data_frames = 0;
    uint32_t beacon_frames = 0;
    uint32_t req_frames = 0;
    uint32_t resp_frames = 0;
    uint32_t deauth_frames = 0;
    uint32_t eapol_frames = 0;
    uint32_t complete_eapol = 0;
    uint32_t flock_devices = 0;
    int8_t min_rssi = 0;
    int8_t max_rssi = -128;

    int bt_frames = 0;

    bool force_pmkid = false;
    bool force_probe = false;
    bool save_pcap = false;
    bool ep_deauth = false;
    bool ble_scanning = false;

    char* flock_ssid[5] = {
      "flock",
      "penguin",
      "pigvision",
      "fs ext battery",
      "Flock"
    };

    #ifdef HAS_DUAL_BAND
      uint8_t channel_activity[DUAL_BAND_CHANNELS] = {};
    #else
      uint8_t channel_activity[MAX_CHANNEL] = {};
    #endif

    uint8_t activity_page = 1;

    String analyzer_name_string = "";
    
    uint8_t analyzer_frames_recvd = 0;

    bool analyzer_name_update = false;

    uint8_t set_channel = 1;

    uint8_t old_channel = 0;

    int16_t _analyzer_value = 0;

    bool orient_display = false;
    bool wifi_initialized = false;
    bool ble_initialized = false;
    bool wifi_connected = false;

    String free_ram = "";
    String old_free_ram = "";
    String connected_network = "";
    char pending_wifi_ssid[33] = {};
    char pending_wifi_password[64] = {};
    bool pending_wifi_credential = false;

    IPAddress ip_addr;
    IPAddress gateway;
    IPAddress subnet;

    IPAddress current_scan_ip;
    IPAddress last_scan_ip;

    uint16_t current_scan_port = 1;
    uint16_t network_scan_result_count = 0;

    String dst_mac = "ff:ff:ff:ff:ff:ff";
    byte src_mac[6] = {};

    #ifdef HAS_SCREEN
      #if !defined(MARAUDER_CARDPUTER) && !defined(MARAUDER_CARDPUTER_ADV)
        int16_t _analyzer_values[TFT_WIDTH];
        int16_t _temp_analyzer_values[TFT_WIDTH];
      #else
        int16_t _analyzer_values[SCREEN_WIDTH];
        int16_t _temp_analyzer_values[SCREEN_WIDTH];
      #endif
    #endif

    String current_mini_kb_ssid = "";

    const String alfa = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ 0123456789-=[];',./`\\_+{}:\"<>?~|!@#$%^&*()";

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();

    #ifndef HAS_IDF_3
      wifi_init_config_t cfg2 = { \
          .event_handler = &esp_event_send_internal, \
          .osi_funcs = &g_wifi_osi_funcs, \
          .wpa_crypto_funcs = g_wifi_default_wpa_crypto_funcs, \
          .static_rx_buf_num = 6,\
          .dynamic_rx_buf_num = 6,\
          .tx_buf_type = 0,\
          .static_tx_buf_num = 1,\
          .dynamic_tx_buf_num = WIFI_DYNAMIC_TX_BUFFER_NUM,\
          .cache_tx_buf_num = 0,\
          .csi_enable = false,\
          .ampdu_rx_enable = false,\
          .ampdu_tx_enable = false,\
          .amsdu_tx_enable = false,\
          .nvs_enable = false,\
          .nano_enable = WIFI_NANO_FORMAT_ENABLED,\
          .rx_ba_win = 6,\
          .wifi_task_core_id = WIFI_TASK_CORE_ID,\
          .beacon_max_len = 752, \
          .mgmt_sbuf_num = 8, \
          .feature_caps = g_wifi_feature_caps, \
          .sta_disconnected_pm = WIFI_STA_DISCONNECTED_PM_ENABLED,  \
          .espnow_max_encrypt_num = 0, \
          .magic = WIFI_INIT_CONFIG_MAGIC\
      };
    #else
      wifi_country_t country = {
        .cc = "PH",
        .schan = 1,
        .nchan = 13,
        .policy = WIFI_COUNTRY_POLICY_AUTO,
      };

      wifi_init_config_t cfg2 = WIFI_INIT_CONFIG_DEFAULT();
    #endif

    wifi_config_t ap_config;

    bool uploadFile(String filePath, bool retry = false, uint8_t upload_type = WIGLE_UPLOAD);
    // PURE WARDRIVER: SD upload credentials (/wifi-upload-credentials.txt
    // with ssid=/pass=, /API.txt with wdg_key=/wu=/wt=). Auto-connect at
    // boot, disconnect after 5 min idle, reconnect on upload menu.
    bool upload_wifi_auto = false;
    bool upload_active = false;
    uint32_t upload_link_ms = 0;
    uint32_t upload_last_try_ms = 0;
    // PURE WARDRIVER: pause live wardrive stats while home is shown mid-scan.
    bool suppress_wardrive_stats = false;
    bool hasUploadCredentialsFile();
    bool loadUploadCredentials(String &ssid, String &pass);
    bool loadUploadApiKeys();
    bool autoConnectUploadWiFi();
    void autoDisconnectUploadWiFi(uint32_t now);
    String checkEmptyProbe(String essid);
    bool checkFlockOUI(const uint8_t mac[6]);
    bool startWiFi(String ssid, String password, bool gui = true);
    bool isFlockCamera(const uint8_t* payload, size_t len, const String& name, String* serial_out);
    int seenBLEDevice(BleDevice ble_device);
    uint16_t rssiToColor(int8_t rssi);
    bool isMetaIdentifier(uint16_t id);
    bool isBlockedIdentifier(uint16_t id);
    #ifdef HAS_BT
      String classifyBLEDevice(MarauderBLEAdvertisedDevice* advertised_device);
      void retainBLEFoxHuntSubtype(MarauderBLEAdvertisedDevice* advertised_device,
                                   const BleDevice& ble_device);
    #endif
    // Pure Wardrive: foxhunt decls removed.
    uint32_t getCompleteEapol(int check_index = -1);
    // Pure Wardrive: analyzer decls removed.
    bool seen_mac(unsigned char* mac, bool simple = true);
    int update_mac_entry(const uint8_t mac[6], int8_t rssi = 0, bool bt = false);
    inline void insert_mac_entry(uint32_t idx, const uint8_t mac[6], uint32_t now_ms, int8_t rssi = 0, bool bt = false);
    void evict_and_insert(const uint8_t mac[6], uint32_t now_ms);
    uint8_t build_top10_for_ui(MacEntry* out_top10, MacSortMode mode);
    void save_mac(unsigned char* mac);
    #ifdef HAS_BT
      void copyNimbleMac(const BLEAddress &addr, unsigned char out[6]);
    #endif
    #ifdef HAS_NIMBLE_2
      // Pure Wardrive: FindMy decls removed.
    #endif
    // Pure Wardrive: target-filter decl removed.
    bool RunGPSInfo(bool tracker = false, bool display = true, bool poi = false);
    void logPoint(String lat, String lon, float alt, String datetime, bool poi = false);
    void setMac();
    // Pure Wardrive: analyzer decls removed.
    String security_int_to_string(int security_type);
    void RunSetup();
    int clearList(uint8_t list_type);
    // Pure Wardrive: attack-list decls removed.
    bool shutdownWiFi();
    bool shutdownBLE();
    bool scanning();
    bool joinWiFi(String ssid, String password, bool gui = true, bool save_credential = true);
    bool joinSavedWiFi(bool gui = true);
    void reloadGeofences();
    bool isGeofencePaused() const { return geofence_paused; }
    bool hasPendingWifiCredential() const;
    bool savePendingWifiCredential(uint8_t replace_index);
    void discardPendingWifiCredential();
    void getMAC(bool get_sta, uint8_t* mac);
    void changeChannel(int chan = -1);
    // Pure Wardrive: attack-list decls removed.
    void RunInfo();
    void RunSetupGPSTracker(uint8_t scan_mode);
    void channelHop(bool filtered = false, bool ranged = false);
    uint8_t currentScanMode = 0;
    void main(uint32_t currentTime);
    void StartScan(uint8_t scan_mode, uint16_t color = 0);
    void StopScan(uint8_t scan_mode);
    void setBaseMacAddress(uint8_t macAddr[6]);

    bool save_serial = false;
    void startPcap(const char* file_name);
    void startLog(const char* file_name);
    void startGPX(const char* file_name);

    static WiFiEventId_t eventId;
    static String lastClientMAC;
    static String lastClientIP;

    static void onWiFiEvent(WiFiEvent_t event, WiFiEventInfo_t info);
    // Pure Wardrive: SAE/sniffer decls removed.
    static inline uint16_t le16(const uint8_t *p);
    static void getMAC(char *addr, uint8_t* data, uint16_t offset);
    static void getMAC(uint8_t* mac, const uint8_t* data, uint16_t offset);
    static void beaconSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    // Pure Wardrive: pentest sniffer decls removed.
    static inline uint32_t hash_mac(const uint8_t mac[6]);
};
#endif
